import { Container, NormalHeader, ScrollableContent } from '@/components';
import NumberText from './NumberText';
import { Box } from '@/components/Theme';
import SingleTitle from './SingleTitle';
import NormalText from './NormalText';

const text = [
  {
    title: 'Нэг. Нэр томьёоны тайлбар',
    normalText:
      'UC апп: гэж технологийн шийдлийг ашиглан ачаа бараа илгээгч болон тээвэрлэгч хоёрын хоорондын харилцааг хурдан шуурхай холбох боломжийг олгож буй байгууллагын өмчлөлийн цахим харилцаа холбооны платформ юм.',
    numberText: [
      'Байгууллага гэж UC мэдээллийн системийг эрхлэн ажиллаж буй хуулийн этгээдийг хэлнэ.',
      'Хэрэглэгч UC мэдээллийн системд бүртгэл үүсгэн тус системийг ашиглаж, түүний үйлчилгээг авч буй хувь хүн, хуулийн этгээдийг.',
      'Тээвэрлэгч гэж UC мэдээллийн системд бүртгэлтэй захиалагчийн хүсэлтээр түүний заасан цэгт өөрийн унаа болон техникүүдээр ачаа барааг найдвартай түргэн шуурхай тээвэрлэх, тохиролцсон ажлыг түргэн шуурхай хийж гүйцэтгэх иргэн болон хуулийн этгээдийг.',
      'Ачаа илгээгч UC мэдээллийн системд бүртгэлтэй иргэн болон хуулийн этгээдийг.',
      'Ачаа хүлээн авагч ачаа илгээгчийн илгээсэн ачаа барааг хүлээж авах иргэн болон хуулийн этгээд.',
      'Тухайн тохирсон ажил үйлчилгээг захиалсан болон гүйцэтгэсэн иргэн болон хуулийн этгээд.',
      'Ачаа бараа гэж ачаа илгээгч нь А цэгээс Б цэгт тээвэрлүүлэх гэж буй эд юмс.',
      'Тохирсон ажил үйлчилгээг тухайн цэгт хийж гүйцэтгэх ажил үйлчилгээ.',
    ],
  },
  {
    title:
      'Хоёр: үйлчилгээний нөхцөл хүчин төгөлдөр болох, нэмэлт, өөрчлөлт оруулах журам',
    numberText: [
      'Хэрэглэгч тус системийн санал болгож буй үйлчилгээг ашиглахын өмнө энэхүү Үйлчилгээний нөхцөлийг анхааралтай уншиж танилцсаны үндсэн дээр хүлээн зөвшөөрч “Зөвшөөрөх” товч дарснаар Үйлчилгээний нөхцөл тухайн хэрэглэгчийн хувьд хүчин төгөлдөр болно.',
      'Хэрэглэгч үйлчилгээний нөхцөлийг анхааралтай уншиж танилцах үүргээ зохих ёсоор гүйцэтгээгүй нь Үйлчилгээний нөхцөл, түүний аливаа заалтыг танилцаагүй, мэдээгүй, ойлгоогүй, хүлээн зөвшөөрөөгүй гэж үзэх эсхүл Хэрэглэгчийн аливаа үүрэг хариуцлагаас чөлөөлөх үндэслэл болохгүй.',
      'Үйлчилгээний нөхцөлтэй танилцаж зөвшөөрснөөр Хэрэглэгч UC мэдээллийн системийн санал болгож буй үйлчилгээтэй холбоотой эрх, үүрэг хариуцлагыг зөвшөөрсөнд тооцно. Хэрэглэгч үйлчилгээний нөхцөлийг зөвшөөрөөгүй бол UC мэдээллийн системийн санал болгож буй үйлчилгээг авахгүй байхыг сануулж байна.',
    ],
  },
  {
    title: 'Гурав: Бүртгэл үүсгэх',
    numberText: [
      'Хэрэглэгч дараах мэдээллийг бөглөсний үндсэн дээр бүртгэл үүсгэх бөгөөд оруулсан мэдээллийн үнэн зөвийг тухайнй этгээд бүрэн хариуцна. Үүнд: утасны дугаар, овог нэр, автомашины мэдээлэл, техникүүдийн мэдээлэл.',
      'Хэрэглэгч хуулийн этгээдийн хамтран ажиллах хүсэлтэй тохиолдолд байгууллагад хандан хүсэлтээ өгч гэрээ байгуулан бүртгэл үүсгэнэ. Ингэхдээ байгууллагыг төлөөлөх ажилтнуудын мэдээллийг өгөх ба дээрх ажилтнуудад UC мэдээллийн системд нэвтрэн санал болгож буй бүхий л үйлчилгээг харах эрхтэй болно.',
      'Бүртгэл үүсгэх хүсэлт UC мэдээллийн системд бүртгүүлэхэд тухайн хэрэглэгчийн бүртгүүлсэн гар утасны дугаарт мессежээр 4 оронтой баталгаажуулах кодоор орсны дараа өөрийн нууц үгээ үүсгэх шаардлагатай. Нууц үгийн аюулгүй байдалтай холбоотой эрсдэлийг байгууллага хариуцахгүй болно.',
      'Байгууллага нь UC мэдээллийн системийн бүтээгдэхүүн, системийн хөгжүүлэлт сайжруулалт, маркетинг, борлуулалтын зорилгоор хэрэглэгчийн мэдээллийг албан хэрэгцээнд ашиглах, хэрэглэгчтэй холбоо барьж болохыг хэрэглэгч зөвшөөрч байна.',
    ],
  },
  {
    title: 'Дөрөв: тээвэрлэгч болон техник хариуцагчын эрх үүрэг',
    numberText: [
      'Тээвэрлэгч болон Техник хариуцагч нь үзүүлсэн үйлчилгээний төлбөрийг Ачаа илгээгчээс нэхэмжлэн авах эрхтэй.',
      'Тээвэрлэгч болон Техник хариуцагч нь ачаа барааг тээвэрлэх нөхцөл тохирох, татгалзах эрхтэй.',
      'Тээвэрлэгч болон Техник хариуцагч нь баталгаажсан үйлчилгээний саналын дагуу ачаа барааг тээвэрлэн мөн тохирсон ажил үйлчилгээг хийж гүйцэтгэх үүрэгтэй.',
      'Тээвэрлэгч болон Техник хариуцагч нь ачаа барааны бүрэн бүтэн байдлыг шалгаж хүлээж авах үүрэгтэй мөн заасан цэгт ямарваа ажил үйлчилгээг үзүүлэхдээ инженер болон хариуцсан ажиллуулж буй хүний зааварчилгаан дор ажиллах үүрэгтэй.',
      'Тээвэрлэгч нь тээвэрлэлтийн явцад ачаа барааны бүрэн бүтэн байдлыг хангах үүрэгтэй. Техник хариуцагч нь заасан цэгт ажил үйлчилгээ үзүүлэхдээ техник болон бусдын эрүүл мэнд амь насыг хамгаалан ажиллах үүрэгтэй.',
      'Тээврийн үйлчилгээтэй холбогдон үүсэх эрсдэлийг Ачаа илгээгч, Тээвэрлэгч болон Ачаа хүлээн авагч талууд хүлээх ба тээврийн үйлчилгээтэй холбогдон үүсэх аливаа маргаанаас Байгууллагыг ангид байлгана. Техник түрээсийн үйлчилгээтэй холбогдон үүсэх эрсдэлийг Техник захиалагч, Техник нийлүүлэгч талууд хүлээх ба техникийн үйлчилгээтэй холбогдох аливаа асуудлаас Анлимитэд каррьер ХХК ангид байлгана.',
      'Тээвэрлэгч болон техник хариуцагч нь ачаа тээвэрлэх мөн ажил үйлчилгээ эрхлэх процесс эхлэхэд утасны байршил тогтоогчийг сайн дурын үндсэн дээр асаасан байна.',
      'Тээвэрлэгч болон Техник хариуцагч нь бусдын олж авсан байршил мэдээллийг бусад этгээдэд задлахгүй байх үүрэгтэй.',
      'Тээвэрлэгч ачаа ачаад замд явж байх үед машинд эвдрэл гарсан цаашид явах боломжгүй болсон үед дараагийн машинд ачаа шилжүүлэн өгөх зардлыг ачаа илгээгчтэй тохиролцох зарчмаар шийдвэрлэнэ үүнд байгууллагыг ангид байлгана. Техник хариуцагч нь тохирсон цэгт ажил үйлчилгээ үзүүлэх явцад техникт гарсан эвдрэл гэмтэл үүнээс гарсан үр дагаварыг Техник захиалагчтай харилцан тохиролцох ба байгууллагыг ангид байлгана.',
    ],
  },
  {
    title: ' Тав: Ачаа илгээг болон техник захиалагчийн эрх, үүрэг',
    numberText: [
      'Ачаа илгээгч болон техник захиалагч нь техник тээврийн үйлчилгээнд хяналт тавих эрхтэй.',
      'Ачаа илгээгч нь тээврийн үйлчилгээний үр дүнд ачааны бүрэн бүтэн байдлыг Тээвэрлэгчээс шалгах, шаардах эрхтэй.',
      'Техник захиалагч нь ажлын явц болон ажлын даалгаврыг техник нийлүүлэгчээс шалгах шаардах эрхтэй.',
      'Ачаа илгээгч болон техник захиалагч нь өөрийн тээвэрлүүлэх ачааны мэдээлэл болон өөрт шаардлагатай техникүүдийн мэдээллийг үнэн зөв оруулах үүрэгтэй.',
      'Ачаа илгээгч нь ачаа барааны бүрэн бүтэн байдлыг Тээвэрлэгч талд баталгаажуулж хүлээлгэн өгөх үүрэгтэй.',
      'Техник захиалагч тухайн ажлын цэгт ХАБЭА-ын зааварчилгаа өгөх мөн тухайн газарт ажил үйлчилгээ явуулахдаа инженер техникийн ажилчдыг байлцуулан ажил үйлчилгээ явуулах үүрэгтэй.',
      'Ачаа илгээгч болон техник захиалагч нь үйлчилгээний төлбөрийг Тээвэрлэгч, Техник нийлүүлэгч талтай харилцан тохиролцсон нөхцөлийн дагуу шилжүүлэх үүрэгтэй.',
      'Тээврийн үйлчилгээтэй холбогдон үүсэх эрсдэлийг Ачаа илгээгч, Тээвэрлэгч болон Ачаа хүлээн авагч талууд хүлээх ба тээврийн үйлчилгээтэй холбогдон үүсэх аливаа маргаанаас Байгууллагыг ангид байлгана.',
      'Техник захиалагч нь техникийн ажил үйлчилгээтэй холбогдон үүсэх эрсдэлийг Техник захиалагч, Техник нийлүүлэгч талууд хүлээх ба техникийн ажил үйлчилгээтэй холбогдох аливаа маргаанаас Байгууллагыг ангид байлгана.',
    ],
  },
  {
    title: 'Зургаа: байгууллагын хариуцлагын хязгаарлалт',
    numberText: [
      'UC мэдээллийн системийн үйлчилгээг ашигласнаар, Хэрэглэгч нь өөрийн эрсдэлийг үнэлэн бүх эрсдэлийг хариуцна.',
      'Байгууллага нь Хэрэглэгчдийн хоорондын тээвэрлэлтйин үйл ажиллагааг зохион байгуулагч биш болно. UC мэдээллийн систем нь Хэрэглэгчийн хуулиар зөвшөөрөгдсөн бараа, үйлчилгээг тээвэрлүүлэх, тээвэрлэх,техникийг захиалах, техникийг нийлүүлэх хүсэлтийг мэдээллийн технологи тусламжтай харилцааг ил тод, хурдан байлгах зорилготой харилцаа холбооны платформ юм.',
      'Системд байршсан бараа үйлчилгээний чанар, аюулгүй байдал, хуулиар зөвшөөрөгдсөн байдал болон тайлбартайгаа нийцэх асуудал Байгууллагаас хяналтаас гадуур байгаа болно.',
      'Хэрэглэгчдийн хооронд гарсан аливаа маргаан, зөрчил нь Байгууллагын оролцоогүйгээр Хэрэглэгчдийн хооронд шийдвэрлэгдэнэ.',
      'Системийн хэрэглэгч нь өөрийн хийсэн үйлдэлд бүрэн хариуцлага хүлээнэ.',
      'Системийн хэрэглэгч нь нэвтрэх мэдээлэл, нууц үгийн аюулгүй байдлыг бүрэн хариуцна.',
      'Ачааг ачсаны дараах замд машинд ямар нэгэн асуудал/эвдрэл гэмтэл/үүссэн тохиолдолд байгууллага хариуцлага хүлээхгүй.',
      'Техник нь ажил үйлчилгээ үзүүлэхдээ техник эвдрэх, төлөвлөгөөт ажил хойшоо сунах гэх мэт асуудал үүсэн тохиолдолд байгууллага хариуцлага хүлээхгүй.',
    ],
  },
  {
    title: 'Долоо: гэнэтийн болон давагдашгүй хүчин зүйл.',
    numberText: [
      'Гэнэтийн болон давагдашгүй хүчин зүйл гэдэгт гал түймэр, газар хөдлөл, салхи шуурга, аянга цахилгаан, үер усны гамшиг зэрэг байгалийн гамшиг, нийтийг хамарсан үймээн самуун, эмх замбараагүй байдал, ажил хаялт, эсэргүүцлийн хөдөлгөөн, гоц халдварт өвчин, дайн, террорист халдлага, төрийн эрх бүхий байгууллагын шийдвэр, хорио, цээр, гуравдагч ханган нийлүүлэгч байгууллагын систем, сүлжээ, интернэт, эрчим хүч, тог цахилгааны тасалдал, сүлжээний хэвийн ажиллагааны горимоос хэтэрсэн гэнэтийн огцом ачаалал зэрэг Талуудын хүсэл зоригоос үл хамаарах, тэдгээрийн хяналтаас гадуур, урьдчилж тооцох ба даван туулах боломжгүй шалтгаануудыг ойлгоно.',
      'Гэнэтийн болон давагвашгүй хүчний шинжтэй нөхцөл байдлын улмаас хүлээсэн үүргээ зохих ёсоор биелүүлэх боломжгүй болсон тохиолдолд нэн даруй нөгөө Талдаа мэдэгдэнэ. Энэ тохиолдолд үүрэг гүйцэтгэх хугацаа нь энэхүү нөхцөл байдал арилах хүртэл хугацаагаар хойшлогдоно.',
    ],
  },
];

const TermsScreen = () => {
  return (
    <Container>
      <NormalHeader title="Үйлчилгээний нөхцөл" hasBack />
      <ScrollableContent edges={['bottom']}>
        <Box gap="m">
          {text.map((item, index) => {
            return (
              <Box key={index} gap="m">
                {item?.title && <SingleTitle title={item.title} />}
                {item?.normalText && <NormalText text={item.normalText} />}
                {item?.numberText && (
                  <Box gap="m">
                    {item.numberText?.map((i, ind) => {
                      return (
                        <NumberText
                          key={ind}
                          number={(ind + 1).toString()}
                          text={i}
                        />
                      );
                    })}
                  </Box>
                )}
              </Box>
            );
          })}
        </Box>
      </ScrollableContent>
    </Container>
  );
};

export default TermsScreen;
